Autodesk.Revit.DB.DatasmithRevitExporterOptions.GetDatasmithRevitExporterOptions
Returns the current user's DatasmithRevitExporterOptions.
Returns:
The DatasmithRevitExporterOptions for the current user.
Since:
2024

Autodesk.Revit.DB.DatasmithRevitExporterOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DatasmithRevitExporterOptions.EnableDatasmithInitializationOnStartup
Return whether the user wants to enable Datasmith Exporter initialization on startup.
Since:
2024

Autodesk.Revit.DB.DatasmithRevitExporterOptions.IgnoreGPUCompatibilityCheckForDatasmithRevitExporterInitialization
Returns whether the user wants to skip Datasmith Exporter intialization.
Since:
2024

Autodesk.Revit.DB.DatasmithRevitExporterOptions.SkipDatasmithRevitExporterInitialization
Returns whether the user wants to skip Datasmith Exporter intialization.
Since:
2024

Autodesk.Revit.DB.DatasmithRevitExporterOptions.#ctor
Since:
2024

Autodesk.Revit.DB.DatasmithRevitExporterOptions
A utility class containing the Revit.ini options settings related to DatasmithRevitExporterOptions.
Since:
2024